[
  {
    "id": 1,
    "title": "The Electric Revolution on Two Wheels: How Yatri is Changing Urban Mobility in Nepal",
    "summary": "Electric motorcycles are redefining urban travel in Nepal, offering silent, efficient, and eco-friendly alternatives to traditional bikes. Yatri’s innovative designs are leading this shift toward sustainable mobility. Discover how they’re changing the streets of Kathmandu.",
    "fullText": "<h2>A New Era of Mobility</h2><p>Electric motorcycles like those from Yatri are transforming how we ride in cities like Kathmandu. With <strong>zero emissions</strong> and <em>silent power</em>, they’re perfect for Nepal’s busy streets. This shift isn’t just a trend—it’s a necessity, given Kathmandu’s notorious air pollution, where PM2.5 levels often exceed WHO guidelines by five times.</p><p>Imagine zipping through traffic without the roar of petrol engines—just pure, efficient energy. But it’s not just about convenience. Electric bikes significantly reduce carbon emissions, making Nepal’s cities cleaner and more sustainable. According to a 2023 study by the Nepal Ministry of Energy, electric vehicles could cut national CO2 emissions by 20% by 2030 if widely adopted.</p><p>Yatri motorcycles offer <strong>cost-effective solutions</strong> for daily commuting. With government incentives and lower maintenance costs (no oil changes or exhaust repairs), electric bikes are becoming an attractive alternative for young professionals and city dwellers. For instance, a Yatri P1 rider saves up to 50% on fuel costs compared to a traditional 150cc bike over a year. ‘This is the future we’ve been waiting for,’ says Rajesh Thapa, a Kathmandu-based commuter who switched to Yatri last year.</p><p>The future of urban transport is here, and it’s electric. Nepal’s transition to clean energy is crucial for reducing air pollution and reliance on fossil fuels. With Yatri’s expanding charging network and partnerships with local hydropower projects, the country is poised to lead South Asia in green mobility. Join the movement toward a smarter, greener Nepal today.</p>",
    "coverImg": "https://images.unsplash.com/photo-1558981403-c5f9899a28bc?q=80&w=800&auto=format&fit=crop",
    "createdAt": "2024-01-15T10:30:00Z",
    "author": "Suman Shrestha",
    "authorPicture": "https://images.unsplash.com/photo-1535713875002-d1d0cf377fde?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 240,
    "downVotes": 12
  },
  {
    "id": 2,
    "title": "Riding the Himalayas: A Biker’s Dream Comes True with Electric Adventure Rides",
    "summary": "Experience the thrill of high-altitude motorcycling in Nepal. The Himalayan trails, powered by electric bikes, offer an unforgettable journey for riders. Learn how electric motorcycles can take adventure biking to the next level.",
    "fullText": "<h2>High Altitude Adventures</h2><p>The Himalayas call to every rider. With a bike built for Nepal’s terrain, like Yatri’s electric models, you can conquer trails with <strong>torque on demand</strong>. These bikes are designed to handle steep inclines and rocky paths, making them ideal for Nepal’s rugged landscapes.</p><p>From <em>Manang</em> to <em>Mustang</em>, the journey is as thrilling as the destination. Traditional fuel-powered motorcycles often struggle with high-altitude performance, but electric bikes provide <strong>instant acceleration</strong> and power regardless of oxygen levels. A Yatri rider recently completed a 300km Himalayan trek, reporting zero performance issues at 5,000 meters above sea level.</p><p>Moreover, electric motorcycles don’t just offer a powerful ride, but also a quieter and more immersive experience. Imagine riding through serene mountain trails, hearing nothing but the wind and the sounds of nature. This is the future of adventure biking, with Yatri’s silent operation enhancing the connection to Nepal’s pristine environments.</p><p>As Nepal expands its electric infrastructure, more charging points are being installed along popular trekking and biking routes. Yatri is partnering with local communities to add fast chargers in regions like Annapurna and Everest Base Camp, ensuring riders can embark on long-haul adventures without worrying about running out of charge. Join the electric adventure today!</p>",
    "coverImg": "https://images.unsplash.com/photo-1600585154340-be6161a56a0c?q=80&w=800&auto=format&fit=crop",
    "createdAt": "2024-02-01T14:15:00Z",
    "author": "Rita Gurung",
    "authorPicture": "https://images.unsplash.com/photo-1494790108377-be9c29b29330?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 175,
    "downVotes": 8
  },
  {
    "id": 3,
    "title": "Why Electric Bikes Are Nepal’s Future: The Role of Sustainable Transportation",
    "summary": "The future of transportation in Nepal lies in sustainable and energy-efficient solutions. Electric bikes provide a cost-effective and eco-friendly alternative, leveraging Nepal’s hydropower potential for a greener tomorrow. Yatri’s P1 is at the forefront of this change.",
    "fullText": "<h2>Green Roads Ahead</h2><p>With Nepal’s hydropower potential, electric bikes like Yatri’s P1 make sense. They’re <strong>cost-effective</strong> and <em>eco-friendly</em>, reducing our carbon footprint. Nepal generates over 90% of its electricity from hydropower, making electric vehicles a natural fit.</p><p>Say goodbye to fuel costs and hello to clean commuting! Traditional petrol bikes consume fuel that is not only expensive but also contributes to high emissions. With the rise in fuel prices, an electric alternative makes financial sense for both individuals and businesses. A Yatri P1 rider can save up to 60% on annual transportation costs compared to a petrol bike, according to a recent study by the Nepal Electric Vehicle Association.</p><p>Beyond affordability, electric motorcycles are <strong>easier to maintain</strong>. No engine oil changes, no exhaust system repairs—just a smooth and simple ride. Yatri’s design minimizes moving parts, reducing maintenance costs by 40% over five years, as reported by early adopters.</p><p>As Nepal aims to become a leader in clean energy, shifting to electric motorcycles is a step toward sustainability. With the right policies and infrastructure, Nepal could set an example for South Asia in green mobility. Yatri’s commitment to local manufacturing and renewable energy partnerships positions it as a pioneer in this transformation.</p>",
    "coverImg": "https://images.unsplash.com/photo-1619761162162-7480d524f1e5?q=80&w=2936&auto=format&fit=crop",
    "createdAt": "2024-02-20T09:45:00Z",
    "author": "Hari Bahadur Thapa",
    "authorPicture": "https://images.unsplash.com/photo-1500648767791-00dcc994a43e?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 322,
    "downVotes": 14
  },
  {
    "id": 4,
    "title": "Customizing Your Yatri Bike: Make It Truly Yours with Unique Modifications",
    "summary": "Your electric ride should reflect your personality. From color customization to power enhancements, Yatri allows you to design the perfect ride. Learn about the latest trends in custom electric bikes.",
    "fullText": "<h2>Your Bike, Your Style</h2><p>Yatri motorcycles offer customization options. Add <strong>personalized colors</strong> or tweak performance with <em>power packs</em>. This flexibility lets riders express their individuality while maintaining eco-friendly performance.</p><p>It’s not just a bike—it’s an extension of you. With advanced design features, you can upgrade your electric bike’s seating, performance, and connectivity options. Choose from matte black, vibrant red, or custom decals inspired by Nepal’s landscapes—over 50,000 riders have personalized their Yatri bikes since launch.</p><p>Customize your bike with digital dashboards, smart navigation, and voice-activated commands. With an all-electric setup, your bike can sync with your smartphone for navigation, ride analytics, and battery monitoring. ‘I added a Himalayan-inspired design to my Yatri P1—it’s now a conversation starter,’ says Amita Gurung, a Kathmandu rider.</p><p>Whether you prefer a minimalist look or a rugged adventure-ready setup, Yatri allows you to create a bike that reflects your riding style. From urban commuters to Himalayan explorers, customization options cater to every rider’s needs, ensuring both style and functionality.</p>",
    "coverImg": "https://images.unsplash.com/photo-1535049979531-a3c737b8caba?q=80&w=2940&auto=format&fit=crop",
    "createdAt": "2024-03-05T16:20:00Z",
    "author": "Anita Tamang",
    "authorPicture": "https://images.unsplash.com/photo-1488426862026-3ee34a7d66df?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 187,
    "downVotes": 9
  },
  {
    "id": 5,
    "title": "The Torque Advantage of Electric Bikes",
    "summary": "Electric bikes deliver instant torque, making them powerful and efficient. Learn how this advantage enhances your riding experience across Nepal’s diverse landscapes. Yatri’s engineering maximizes this power for riders.",
    "fullText": "<h2>Instant Power</h2><p>Electric bikes deliver <strong>instant torque</strong>, unlike petrol engines. Yatri’s designs harness this for <em>quick acceleration</em> on Nepal’s roads, offering a smooth and responsive ride.</p><p>Feel the thrill from the first twist! This instant power is especially valuable on Nepal’s hilly terrain, where steep climbs demand maximum torque. Yatri’s electric motors provide up to 100 Nm of torque instantly, compared to the gradual build-up in petrol bikes, as confirmed by a 2024 performance test by Nepal Auto Tech.</p><p>Beyond performance, this advantage reduces wear and tear. Electric bikes have fewer moving parts, leading to longer lifespans and lower maintenance costs. ‘The torque makes my Yatri P1 feel like it’s always ready to climb,’ says Bikram Joshi, a Pokhara-based rider who frequently navigates mountainous routes.</p><p>For urban riders, instant torque means quicker starts at traffic lights, improving safety and efficiency in Kathmandu’s congestion. Yatri’s engineering ensures this power is paired with a lightweight frame, making it ideal for both city and adventure biking in Nepal.</p>",
    "coverImg": "https://images.unsplash.com/photo-1633074543327-c386b4f807fa?q=80&w=2940&auto=format&fit=crop",
    "createdAt": "2024-03-25T11:10:00Z",
    "author": "Bikash Karki",
    "authorPicture": "https://images.unsplash.com/photo-1544005313-94ddf0286df2?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 211,
    "downVotes": 5
  },
  {
    "id": 6,
    "title": "Charging Up: Yatri’s Network in Nepal",
    "summary": "Yatri’s growing charging infrastructure ensures seamless long-distance travel. Learn how fast charging supports your journey across Nepal.",
    "fullText": "<h2>Charge and Go</h2><p>Yatri’s DC fast chargers across Nepal mean less downtime. Plug in, grab a <em>coffee in Jhamsikhel</em>, and ride with a full <strong>battery</strong>. With over 50 stations now operational, Yatri is building Nepal’s largest electric bike charging network.</p><p>Mobility without the wait. Each charger can juice up a Yatri P1 to 80% in just 30 minutes, thanks to advanced DC fast-charging technology. This is critical for long-distance riders, like those traveling from Kathmandu to Pokhara, covering 200km with ease.</p><p>Yatri partners with local businesses and hydropower projects to expand this network, ensuring chargers are available in remote areas like Mustang and Jumla. ‘I never worry about range anymore,’ says Sunita Lama, a frequent traveler who relies on Yatri’s infrastructure for her Himalayan rides.</p><p>The network isn’t just convenient—it’s sustainable. Powered by Nepal’s renewable hydropower, these chargers reduce the carbon footprint of electric biking, aligning with Yatri’s mission for green mobility. Plan your next adventure with confidence!</p>",
    "coverImg": "https://images.unsplash.com/photo-1614809856138-8942e41fc4cc?q=80&w=3174&auto=format&fit=crop",
    "createdAt": "2024-04-10T13:00:00Z",
    "author": "Sarita Lama",
    "authorPicture": "https://images.unsplash.com/photo-1529626455594-4ff0802cfb7e?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 265,
    "downVotes": 11
  },
  {
    "id": 7,
    "title": "Electric Biking in Kathmandu Traffic",
    "summary": "Navigate Kathmandu’s chaotic streets with ease on a Yatri electric bike. Silent operation and agility make it the ultimate urban companion.",
    "fullText": "<h2>Urban Survival</h2><p>Kathmandu’s chaos is no match for a nimble Yatri bike. Use <strong>agility</strong> and <em>silent power</em> to slip through jams. With traffic congestion often causing delays of up to two hours, electric bikes offer a lifeline for commuters.</p><p>Ride smarter, not harder. Yatri’s lightweight design and instant torque allow riders to weave through narrow alleys and busy intersections with ease. The silent operation reduces noise pollution, a major issue in Kathmandu, where decibel levels frequently exceed safe limits.</p><p>‘I cut my commute time in half with my Yatri P1,’ says Raju Shrestha, a daily commuter from Patan to Thamel. The bike’s regenerative braking also extends battery life, making it ideal for stop-and-go traffic.</p><p>Plus, Yatri’s partnership with Kathmandu’s traffic authorities promotes electric adoption through incentives, like free parking at key locations. Electric biking isn’t just practical—it’s a step toward cleaner, quieter cities in Nepal.</p>",
    "coverImg": "https://images.unsplash.com/photo-1589916179916-55151aecea0e?w=900&auto=format&fit=crop",
    "createdAt": "2024-04-25T15:30:00Z",
    "author": "Krishna Prasad Adhikari",
    "authorPicture": "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 198,
    "downVotes": 7
  },
  {
    "id": 8,
    "title": "The Café Racer Revival",
    "summary": "Yatri blends classic café racer style with cutting-edge electric tech. Discover how this fusion appeals to riders seeking both aesthetics and performance.",
    "fullText": "<h2>Retro Meets Electric</h2><p>Yatri blends café racer aesthetics with <strong>electric innovation</strong>. Ride a <em>classic</em> that’s built for today, combining vintage style with modern efficiency.</p><p>Style and substance in one. Yatri’s café racer models feature sleek lines, low-slung seats, and matte finishes, inspired by 1960s designs, but powered by silent electric motors. Over 10,000 riders have chosen this model for its unique look and 120km range.</p><p>‘It’s like owning a piece of history with a green twist,’ says Bikram Tamang, a Kathmandu enthusiast. The bike’s lightweight frame and instant torque make it perfect for city cruises and short adventures, while its regenerative braking system extends battery life by up to 15%.</p><p>With Yatri’s customization options, you can add chrome accents or LED lighting to match your style. This revival isn’t just nostalgic—it’s a sustainable statement for Nepal’s biking community.</p>",
    "coverImg": "https://images.unsplash.com/photo-1558980664-28d10ee9bb52?w=900&auto=format&fit=crop",
    "createdAt": "2024-05-10T09:15:00Z",
    "author": "Pooja Rai",
    "authorPicture": "https://images.unsplash.com/photo-1488426862026-3ee34a7d66df?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 234,
    "downVotes": 10
  },
  {
    "id": 9,
    "title": "Yatri’s Vision for Sustainable Mobility",
    "summary": "Yatri Motorcycles aims to revolutionize Nepal’s transport with sustainable electric solutions. Learn about their mission to reduce emissions and enhance urban life.",
    "fullText": "<h2>Green Vision</h2><p>Yatri’s mission is clear: sustainable mobility for Nepal. With <strong>electric power</strong>, they’re cutting emissions and enhancing <em>urban life</em>. Nepal’s commitment to clean energy aligns perfectly with Yatri’s goals.</p><p>A cleaner future starts here. By 2030, Yatri aims to deploy 100,000 electric bikes across Nepal, reducing CO2 emissions by 500,000 tons annually, according to their sustainability report. This vision is supported by partnerships with the Nepal Electricity Authority and local hydropower plants.</p><p>‘We’re not just building bikes—we’re building a cleaner Nepal,’ says CEO Anil Gurung. Yatri’s focus on local manufacturing reduces import dependency, creating jobs and boosting the economy while minimizing environmental impact.</p><p>From urban commuters to rural adventurers, Yatri’s bikes are designed for every rider. With expanding charging networks and eco-friendly designs, Yatri is leading Nepal’s transition to green transportation.</p>",
    "coverImg": "https://images.unsplash.com/photo-1493238792000-8113da705763?q=80&w=800&auto=format&fit=crop",
    "createdAt": "2024-05-25T11:45:00Z",
    "author": "Nabin Pokharel",
    "authorPicture": "https://images.unsplash.com/photo-1539571696357-5a69c17a67c6?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 287,
    "downVotes": 13
  },
  {
    "id": 10,
    "title": "Adventure Biking in Pokhara",
    "summary": "Explore Pokhara’s scenic trails on a Yatri electric bike. From lakeside paths to hilly routes, experience adventure with sustainable power.",
    "fullText": "<h2>Lake to Peak</h2><p>Pokhara’s trails are calling. With a Yatri bike’s <strong>range</strong>, ride from <em>Phewa Lake</em> to the hills. The region’s stunning landscapes are perfect for electric biking.</p><p>Adventure awaits. Yatri’s electric bikes offer a 150km range on a single charge, ideal for exploring Pokhara’s trails, from lakeside paths to the challenging routes toward Sarangkot. Riders report enjoying the quiet ride, immersing themselves in nature’s sounds.</p><p>‘I rode my Yatri P1 to Sarangkot at sunrise—it was unforgettable,’ says Laxmi Thapa, a local adventure enthusiast. The bike’s instant torque handles steep inclines effortlessly, while regenerative braking conserves energy on descents.</p><p>With Yatri’s expanding charging network in Pokhara, including stations near Lakeside, long-distance rides are easier than ever. Pair this with Nepal’s clean hydropower, and you’ve got a sustainable adventure waiting for you.</p>",
    "coverImg": "https://images.unsplash.com/photo-1558980664-3a031cf67ea8?w=900&auto=format&fit=crop",
    "createdAt": "2024-06-05T14:00:00Z",
    "author": "Laxmi Bhandari",
    "authorPicture": "https://images.unsplash.com/photo-1488426862026-3ee34a7d66df?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 192,
    "downVotes": 6
  },
  {
    "id": 11,
    "title": "Electric vs. Petrol: The Ultimate Comparison",
    "summary": "How do electric bikes stack up against petrol ones? This in-depth comparison explores cost, performance, and environmental impact, with Yatri leading the electric charge. Discover why electric is winning the race in Nepal.",
    "fullText": "<h2>Power Play</h2><p>Petrol roars, but electric like Yatri’s <strong>saves money</strong> and the planet. <em>Torque</em> beats noise any day. This comparison highlights why electric bikes are the smarter choice for Nepal.</p><p>Which side are you on? A Yatri P1 costs roughly 30% less to operate annually than a 150cc petrol bike, factoring in fuel, maintenance, and taxes. Petrol bikes emit an average of 2.5 tons of CO2 per year per rider, while Yatri’s electric models produce zero tailpipe emissions, powered by Nepal’s hydropower.</p><p>Performance-wise, electric bikes offer instant torque—up to 100 Nm on Yatri models—outpacing many petrol bikes off the line. However, petrol bikes may offer longer ranges (up to 300km) compared to Yatri’s 150km, though charging infrastructure is rapidly closing this gap.</p><p>‘I switched to Yatri for the savings and silence,’ says Suresh Rana, a Kathmandu rider. With Yatri’s lower maintenance and government subsidies, electric bikes are gaining traction, especially among eco-conscious Nepalis. The choice is clear for a sustainable future.</p>",
    "coverImg": "https://images.unsplash.com/photo-1535049979531-a3c737b8caba?q=80&w=2940&auto=format&fit=crop",
    "createdAt": "2024-06-20T10:20:00Z",
    "author": "Dinesh Bhattarai",
    "authorPicture": "https://images.unsplash.com/photo-1488426862026-3ee34a7d66df?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 305,
    "downVotes": 15
  },
  {
    "id": 12,
    "title": "The Joy of Silent Rides",
    "summary": "Yatri’s electric bikes offer a quiet, peaceful riding experience. Discover why silence is the future of motorcycling in Nepal’s bustling cities.",
    "fullText": "<h2>Peaceful Power</h2><p>Yatri’s electric bikes offer <strong>silence</strong> without sacrifice. Hear the <em>wind</em>, not the engine. This quiet operation is transforming Nepal’s noisy urban landscapes.</p><p>It’s riding redefined. In cities like Kathmandu, where noise pollution reaches 85 decibels on average, Yatri’s silent bikes reduce stress for riders and pedestrians alike. A 2024 survey by Nepal’s Department of Environment found that electric vehicles could lower urban noise by 30%, improving quality of life.</p><p>‘I love how peaceful my rides are now,’ says Anita Sherpa, a daily commuter. The silent operation also enhances safety, as riders can hear traffic signals and pedestrians more clearly. Yatri’s design includes sound alerts for blind spots, ensuring a safe yet quiet ride.</p><p>With Nepal’s push for cleaner cities, silent rides are becoming a hallmark of modern motorcycling. Yatri is leading this change, offering both sustainability and serenity for Nepal’s riders.</p>",
    "coverImg": "https://images.unsplash.com/photo-1600585154340-be6161a56a0c?q=80&w=800&auto=format&fit=crop",
    "createdAt": "2024-07-05T12:30:00Z",
    "author": "Sunita Magar",
    "authorPicture": "https://images.unsplash.com/photo-1494790108377-be9c29b29330?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 220,
    "downVotes": 9
  },
  {
    "id": 13,
    "title": "Building Bikes in Nepal",
    "summary": "Yatri proves Nepal can produce world-class motorcycles. Local innovation and talent are driving this homegrown electric revolution.",
    "fullText": "<h2>Made in Nepal</h2><p>Yatri proves world-class bikes can come from Nepal. With <strong>local talent</strong> and <em>vision</em>, we’re riding into the future. Yatri’s factory in Lalitpur employs over 300 Nepali engineers and craftsmen.</p><p>Proudly Nepali. By manufacturing locally, Yatri reduces import costs and supports Nepal’s economy, creating jobs while maintaining high-quality standards. Each bike is tested on Kathmandu’s roads and Himalayan trails to ensure durability and performance.</p><p>‘We’re building bikes for Nepal, by Nepalis,’ says Yatri’s CTO, Priya Adhikari. The company uses locally sourced materials, like aluminum from Pokhara, and partners with Nepali hydropower for sustainable production. This approach cuts carbon emissions by 25% compared to imported bikes.</p><p>With over 15,000 Yatri bikes on Nepal’s roads, local production is proving its worth. Join the movement to support Nepal’s electric mobility revolution and ride a bike made with pride.</p>",
    "coverImg": "https://images.unsplash.com/photo-1535049979531-a3c737b8caba?q=80&w=2940&auto=format&fit=crop",
    "createdAt": "2024-07-20T16:10:00Z",
    "author": "Ramesh Nepal",
    "authorPicture": "https://images.unsplash.com/photo-1494790108377-be9c29b29330?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 276,
    "downVotes": 11
  },
  {
    "id": 14,
    "title": "Gear Up: Motorcycle Essentials",
    "summary": "Stay safe and stylish with the right gear. From helmets to jackets, here’s what every Yatri rider needs for the road.",
    "fullText": "<h2>Ride Prepared</h2><p>From <strong>helmets</strong> to <em>jackets</em>, gear keeps you safe on your Yatri bike. Proper equipment is essential for Nepal’s varied terrain.</p><p>Style meets safety for every journey. A certified helmet reduces the risk of head injuries by 70%, according to Nepal’s Traffic Directorate. Yatri recommends DOT-approved helmets, paired with waterproof jackets for monsoon rides and padded gloves for grip on Himalayan trails.</p><p>‘I never hit the road without my Yatri-branded gear,’ says Bikram Gurung, a seasoned rider. Yatri also offers reflective vests for night riding and smart helmets with Bluetooth for hands-free navigation, ensuring both safety and connectivity.</p><p>Choose gear that matches your riding style—urban, adventure, or long-distance. With Yatri’s recommendations, you’ll ride confidently and look great while doing it.</p>",
    "coverImg": "https://images.unsplash.com/photo-1558981403-c5f9899a28bc?q=80&w=800&auto=format&fit=crop",
    "createdAt": "2024-08-01T09:50:00Z",
    "author": "Tara Devi Chhetri",
    "authorPicture": "https://images.unsplash.com/photo-1488426862026-3ee34a7d66df?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 160,
    "downVotes": 4
  },
  {
    "id": 15,
    "title": "The Yatri Community",
    "summary": "Join a growing community of riders passionate about sustainability and innovation. Yatri is more than a bike—it’s a movement.",
    "fullText": "<h2>Ride Together</h2><p>Yatri isn’t just a bike—it’s a movement. Connect with <strong>riders</strong> who value <em>sustainability</em>. With over 25,000 members, the Yatri community is thriving across Nepal.</p><p>Be part of the change. Members organize group rides, share tips, and advocate for electric mobility policies. Recent events include a 100km ride from Kathmandu to Pokhara, raising awareness about clean energy.</p><p>‘The Yatri community gave me lifelong friends and a purpose,’ says Sita Rai, an active member. The community also offers workshops on bike maintenance, charging tips, and eco-friendly riding practices, fostering a network of passionate riders.</p><p>Join online forums, attend local meetups, or participate in Yatri’s annual Green Ride Challenge. Together, we’re driving Nepal toward a sustainable future—one ride at a time.</p>",
    "coverImg": "https://images.unsplash.com/photo-1600585154340-be6161a56a0c?q=80&w=800&auto=format&fit=crop",
    "createdAt": "2024-08-15T13:20:00Z",
    "author": "Prakash Subedi",
    "authorPicture": "https://images.unsplash.com/photo-1539571696357-5a69c17a67c6?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 245,
    "downVotes": 8
  },
  {
    "id": 16,
    "title": "Winter Riding with Yatri",
    "summary": "Ride through Nepal’s chilly winters with confidence. Yatri’s electric bikes offer reliable performance in cold weather.",
    "fullText": "<h2>Winter Roads</h2><p>Winter in Nepal doesn’t stop Yatri riders. With <strong>reliable batteries</strong>, enjoy <em>smooth rides</em> even in the cold. Temperatures can drop below 0°C in mountainous regions, but Yatri’s technology adapts.</p><p>Stay warm and keep riding. Yatri’s battery management system maintains performance in sub-zero conditions, with a 10% range buffer for cold weather. Riders can add heated grips and thermal covers for extra comfort during long winter rides.</p><p>‘I rode my Yatri P1 through Mustang’s snow in December—it handled perfectly,’ says Tenzin Sherpa, an adventure rider. The bike’s silent operation enhances safety, as you can hear icy patches or approaching vehicles more clearly.</p><p>With Nepal’s winter tourism growing, Yatri’s electric bikes are ideal for snowy adventures. Pair them with winter gear and charging in cozy lodges for an unforgettable ride.</p>",
    "coverImg": "https://images.unsplash.com/photo-1535049979531-a3c737b8caba?q=80&w=2940&auto=format&fit=crop",
    "createdAt": "2024-08-30T11:00:00Z",
    "author": "Gita Poudel",
    "authorPicture": "https://images.unsplash.com/photo-1607746882042-944635dfe10e?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 183,
    "downVotes": 6
  },
  {
    "id": 17,
    "title": "The Science of Electric Bike Batteries",
    "summary": "What powers Yatri’s electric bikes? Dive into the technology behind their high-performance batteries and long-range capabilities. See how innovation drives every ride.",
    "fullText": "<h2>Battery Power</h2><p>Yatri’s bikes run on cutting-edge <strong>batteries</strong>. Learn how they deliver <em>range</em> and reliability. Yatri uses lithium-ion batteries with a capacity of 7.2 kWh, offering up to 150km per charge.</p><p>Science meets the road. These batteries feature advanced thermal management, maintaining performance in Nepal’s extreme climates—from Kathmandu’s heat to Himalayan cold. A 2024 test showed Yatri batteries retain 95% capacity after 1,000 cycles, outlasting many competitors.</p><p>‘The battery tech is what sets Yatri apart,’ says engineer Anil Karki. Fast charging takes just 30 minutes to reach 80%, thanks to Yatri’s proprietary DC system, reducing downtime on long rides.</p><p>With recyclable materials and partnerships with Nepali battery recyclers, Yatri ensures sustainability. This innovation drives Nepal’s electric mobility revolution, making every ride smarter and greener.</p>",
    "coverImg": "https://images.unsplash.com/photo-1600585154340-be6161a56a0c?q=80&w=800&auto=format&fit=crop",
    "createdAt": "2024-09-10T14:40:00Z",
    "author": "Santosh Dahal",
    "authorPicture": "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 299,
    "downVotes": 12
  },
  {
    "id": 18,
    "title": "Yatri’s Design Philosophy",
    "summary": "Behind every Yatri bike is a thoughtful design process. Explore how form, function, and sustainability shape their electric motorcycles.",
    "fullText": "<h2>Design Matters</h2><p>Yatri blends <strong>form</strong> and <em>function</em> in every bike. Sustainability drives their design philosophy, ensuring every detail serves a purpose.</p><p>Ride a masterpiece. Yatri’s bikes feature aerodynamic frames, lightweight materials like aluminum, and ergonomic seats for comfort during long rides. The matte black finish, inspired by Nepal’s mountains, reduces glare and adds style.</p><p>‘Our design prioritizes the rider’s experience,’ says designer Sita Bhandari. Each model integrates smart features like LED headlights and touchscreen dashboards, powered by Nepal’s renewable energy vision. Yatri’s use of recycled plastics cuts production emissions by 15%, aligning with their green mission.</p><p>From urban commuters to Himalayan adventurers, Yatri’s design ensures versatility and efficiency. This philosophy makes every ride both functional and beautiful, setting a standard for Nepal’s electric biking industry.</p>",
    "coverImg": "https://images.unsplash.com/photo-1600585154340-be6161a56a0c?q=80&w=800&auto=format&fit=crop",
    "createdAt": "2024-09-25T10:15:00Z",
    "author": "Maya Sherpa",
    "authorPicture": "https://images.unsplash.com/photo-1529626455594-4ff0802cfb7e?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 210,
    "downVotes": 7
  },
  {
    "id": 19,
    "title": "Motorcycle Safety Tips for Nepal",
    "summary": "Stay safe on Nepal’s diverse roads with these essential tips. From urban traffic to mountain trails, Yatri riders need to be prepared.",
    "fullText": "<h2>Ride Smart</h2><p>Safety is key on Nepal’s roads. Follow these <strong>tips</strong> for urban and <em>mountain riding</em>. Nepal’s roads are challenging, but Yatri’s electric bikes enhance safety with advanced features.</p><p>Protect yourself and enjoy the ride. Always wear a DOT-certified helmet—studies show they reduce fatal crash risks by 70%. Use reflective gear for night rides in Kathmandu and check tire pressure for mountain trails, where Yatri’s instant torque helps maintain control.</p><p>‘Safety gear saved me on a Himalayan ride,’ says Arun Lama, a Yatri rider. The bike’s regenerative braking and silent operation improve awareness, while Yatri’s app offers real-time road hazard alerts.</p><p>Prepare for monsoon rains with waterproof jackets and maintain your bike regularly. With Yatri’s training programs and safety workshops, riders can confidently explore Nepal’s roads, from city streets to remote paths.</p>",
    "coverImg": "https://images.unsplash.com/photo-1600585154340-be6161a56a0c?q=80&w=800&auto=format&fit=crop",
    "createdAt": "2024-10-05T12:50:00Z",
    "author": "Arjun Koirala",
    "authorPicture": "https://images.unsplash.com/photo-1539571696357-5a69c17a67c6?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 167,
    "downVotes": 5
  },
  {
    "id": 20,
    "title": "The Future of Electric Motorcycling",
    "summary": "Where is electric motorcycling headed? Yatri’s innovations hint at a future of smarter, greener, and more connected rides across Nepal and beyond.",
    "fullText": "<h2>Looking Ahead</h2><p>The future is electric, and Yatri is leading the way with <strong>smart tech</strong> and <em>green design</em>. Nepal’s electric mobility revolution is just beginning.</p><p>Ride into tomorrow. Yatri plans to integrate AI-driven navigation by 2026, predicting traffic and optimizing battery use for Nepal’s roads. Their next-gen bikes will feature solar panels for auxiliary power, extending range by up to 10% in sunny areas like Pokhara.</p><p>‘We’re envisioning a connected, sustainable future,’ says Yatri’s CTO, Nabin Shrestha. With partnerships for autonomous charging and IoT-enabled bikes, Yatri aims to reduce emissions by 1 million tons annually by 2035.</p><p>Beyond Nepal, Yatri’s innovations could inspire South Asia’s electric biking boom. Join the journey toward smarter, greener rides and shape the future of motorcycling with Yatri.</p>",
    "coverImg": "https://images.unsplash.com/photo-1600585154340-be6161a56a0c?q=80&w=800&auto=format&fit=crop",
    "createdAt": "2024-10-20T15:30:00Z",
    "author": "Kiran Thapa",
    "authorPicture": "https://images.unsplash.com/photo-1500648767791-00dcc994a43e?q=80&w=150&h=150&auto=format&fit=crop",
    "upVotes": 315,
    "downVotes": 10
  }
]